OpenFOAM-11/tutorials/multiphaseEuler/bed/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                         none;

    div(phi,alpha)            Gauss vanLeer;
    div(phir,alpha,alpha)   Gauss vanLeer;

    div(alphaRhoPhi,U)      Gauss limitedLinearV 1;
    div(phi,U)              Gauss limitedLinearV 1;

    "div\(alphaRhoPhi,(h|e)\)"  Gauss limitedLinear 1;
    div(alphaRhoPhi,K)      Gauss limitedLinear 1;
    div(alphaRhoPhi,(p|rho)) Gauss limitedLinear 1;

    div((((alpha*rho)*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}


// ************************************************************************* //
